{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Body",
    "1": "BodyH",
    "2": "BodyP",
    "3": "Comment",
    "4": "Formula_calculator",
    "5": "Formula_calculatorH",
    "6": "H",
    "7": "HBody",
    "8": "HFormula_calculator",
    "9": "Header",
    "10": "Headers",
    "11": "P",
    "12": "Wartermark",
    "13": "WatermarkP",
    "14": "body",
    "15": "watermark"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "Body": 0,
    "BodyH": 1,
    "BodyP": 2,
    "Comment": 3,
    "Formula_calculator": 4,
    "Formula_calculatorH": 5,
    "H": 6,
    "HBody": 7,
    "HFormula_calculator": 8,
    "Header": 9,
    "Headers": 10,
    "P": 11,
    "Wartermark": 12,
    "WatermarkP": 13,
    "body": 14,
    "watermark": 15
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
